{
  "vContextInfo": {
    "version": "0.4"
  },
  "todoList": {
    "narrative": {
      "Overview": "Simplify narrative structure by making Plan narratives use strings instead of Narrative objects, while keeping Narrative objects for item-level narratives (TodoItem, PlanItem, TodoList, Playbook) where semantic context isn't provided by structure."
    },
    "items": [
      {
        "id": "t1",
        "title": "Update Narrative definition and Plan narrative structure in README.md",
        "status": "completed",
        "narrative": {
          "Result": "Updated Plan core spec to use 'proposal: string' and added note explaining Plan narratives use strings (key provides context) while item narratives use Narrative objects (no structural context). Updated minimal Plan examples in both TRON and JSON."
        }
      },
      {
        "id": "t2",
        "title": "Update Extension 3 Plan narratives to use strings",
        "status": "completed",
        "narrative": {
          "Result": "Updated all 13 Plan narrative fields in Extension 3 from Narrative type to string type. Changed custom from Narrative[] to string[]."
        }
      },
      {
        "id": "t3",
        "title": "Update JSON schema Plan narratives to string type",
        "status": "completed",
        "narrative": {
          "Result": "Changed all Plan narrative properties from Narrative refs to string type in vcontext-core.schema.json. Updated custom from array of Narrative to array of string."
        }
      },
      {
        "id": "t4",
        "title": "Update all Plan narrative examples to use strings",
        "status": "completed",
        "narrative": {
          "Result": "Updated Appendix A2 Plan example in both TRON and JSON formats. Replaced all Narrative(title, content) calls with bare strings for all 11 narrative fields."
        }
      },
      {
        "id": "t5",
        "title": "Update Extension 3 and 4 example Plan narratives",
        "status": "completed",
        "narrative": {
          "Result": "Updated Extension 4 example Plan narratives in both TRON and JSON to use bare strings."
        }
      },
      {
        "id": "t6",
        "title": "Commit and push changes",
        "status": "pending"
      }
    ]
  }
}
